Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G60A.tmx
Source language: en_us
Languages: zh_cn

source: Gregory Smith
zh_cn: 格雷戈里史密斯

source: Gregory Smith - sounds like an ordinary name, doesn't it.
zh_cn: 格雷戈里史密斯听上去是很普通的一个名字，不是吗？

source: In fact, according to the U.S. Census Bureau, Smith is one of the most commonly occurring surnames in the United States.
zh_cn: 事实上，根据美国人口普查局的调查，在美国，史密斯是最常出现的姓之一。

source: It's in the top five.
zh_cn: 是五大姓氏之一。

source: Actually, it's number one.
zh_cn: 事实上，史密斯这个姓数量上处于第一位。

source: And, the name "Gregory" is in the top 40 for the most commonly occurring first names.
zh_cn: 而且，格雷戈里这个名字，在最常出现的名字中排名前40。

source: Yes, it is an ordinary name.
zh_cn: 确实，格雷戈里史密斯就是一个普通的名字。

source: But as it turns out, Gregory Smith is anything but ordinary.
zh_cn: 但是，事实证明，格雷戈里?史密斯绝不平凡。

source: Gregory Smith has a college degree.
zh_cn: 格雷戈里史密斯拥有一份大学文凭。

source: To be specific, he graduated Cum Laude with a BS in Mathematics and minors in both History and Biology with Honors.
zh_cn: 具体地说，他以一个的优等的成绩毕业的——数学理学士文凭和兼修的历史和生物学荣誉文凭。

source: OK, you're probably thinking, "Lots of people have college degrees - that's not so extraordinary."
zh_cn: 好的，你可能会想：“这并不是很非凡的事，很多人都拥有大学文凭，”

source: Keep reading.
zh_cn: 请继续读下去。

source: Smith looks at education as a firm foundation for his future, "The academic foundation I am building will interconnect throughout my future as I aspire to make lasting contributions for the benefit of my country and to be of service to the world." Right now, he is working on a graduate degree in math at the University of Virginia.
zh_cn: 史密斯把学习看做他未来坚实的基础，"我正打造的理论基础将会与我的未来相连，因为我想为我国家的利益做出持久的贡献，并且为全世界服务"现在，他正在弗吉尼亚大学攻读数学研究生学位。

source: Smith received an important scholarship -- The Jack Kent Cooke award -- that should be enough to pay for graduate school.
zh_cn: 史密斯得到了一个足够付清他读研的费用的，很有权威的奖学金——杰克肯特库克奖。

source: It will provide up to $50,000 per year to complete his PhD.
zh_cn: 它将每年提供高达5万美元让他完成博士学位。

source: Reportedly, this won't be Smith's only graduate degree.
zh_cn: 据报道，这不会是史密斯获得的唯一一个研究生学位。

source: He also plans to study biomedical research, aerospace engineering and international relations at the graduate level.
zh_cn: 他还打算学习研究生等级的生物医学研究，航空航天工程和国际关系这几门课程。

source: Again, you're probably thinking, "Hey, other people go to graduate school and get good scholarships." That's true, but keep reading.
zh_cn: 你可能又会再一次想到：“嘿，其他人也会去读研并且获得丰厚的奖学金”你的想法是对的，但是，请继续读下去。

source: Smith is the co-chair for the World of Children Awards.
zh_cn: 史密斯是世界儿童奖的副主席。

source: He's in good company -- the other chair is three-time heavyweight boxing champion, Muhammad Ali.
zh_cn: 他在一个优秀的公司——另一个主席是三次重量级拳击冠军的得主，默罕默德阿里。

source: The World of Children Awards recognizes people who dedicate their lives to helping children all around the world.
zh_cn: 世界儿童奖承认把自己的生命奉献给帮助全世界儿童的人。

source: The fact that Smith is co-chairing such an event is not surprising; he founded International Youth Advocates (IYA).
zh_cn: 事实上，史密斯是副主席这件事并不会令人意外，他建立了国际青少年策进会。

source: The mission of IYA is to protect young people from violent situations and to help promote good educational services and living conditions for kids.
zh_cn: 国际青少年策进会的任务就是保护年轻人免受暴力行为，并且给孩子们推动好的教育服务和生活条件。

source: The organization does this by working with other key groups like the Christian Children's Fund and the World Centers of Compassion for Children.
zh_cn: 国际青少年策进会这个组织是通过跟基督教儿童基金和同情儿童的世界中心这些主要的组织在一起合作来达到自己组织的目的。

source: Together, they collect everything from educational material to clothing to medical supplies and deliver it to people all around the world.
zh_cn: 他们在一起收集物资，从教育的材料到衣着到医疗用品，并且发放给全世界的人。

source: Yeah, we know, "Other people have started worthwhile organizations like this."
zh_cn: 是的，我们都知道，“其他人也建立过像这样有价值的组织”。

source: Just keep reading, please.
zh_cn: 请继续往下读。

source: Gregory Smith has spoken before the United Nations as a delegate for the very first children's summit.
zh_cn: 格雷戈里 史密斯曾作为联合国第一个儿童峰会的代表演说过。

source: He's been nominated for the Nobel Peace Prize - three times.
zh_cn: 他三次被诺贝尔和平奖提名。

source: The first nomination was in 2002, the second in 2003, and the third in 2004.
zh_cn: 第一次作为候选人是在2002年，第二次在2003年，第三次在2004年。

source: Smith has been in the company of and worked closely with several of today's most notable leaders and other political figures.
zh_cn: 史密斯一直以来都和一些当今世界著名的领导人和其他政治人物密切合作过。

source: Among those on the lengthy list are former U.S. President Bill Clinton, former Russian President Michel Gorbachev, 1984 Nobel Peace Prize Winner Desmond Tutu and 1976 Nobel Peace Laureate Betty Williams.
zh_cn: 在那些冗长的名单中包括美国前总统比尔克林顿，俄罗斯前总统米歇尔戈尔巴乔夫，1984年诺贝尔和平奖的获得者德斯蒙德图特和1976年诺贝尔和平奖的获得者贝蒂威廉姆斯。

source: Now you're starting to get the picture.
zh_cn: 现在你可以开始想象这个画面。

source: Not everyone gets nominated for the Nobel Peace Prize.
zh_cn: 并不是每个人都会被诺贝尔和平奖提名的。

source: But, you'll want to keep reading. It gets even more impressive. Promise.
zh_cn: 但是，如果你继续读下去，我保证，接下来的事会更让你印象深刻。

source: Smith is a spokesperson for the World Centers of Compassion for Children and an ambassador for the Christian Children's Fund.
zh_cn: 史密斯是同情儿童世界中心和基督教儿童基金会大使的发言人。

source: His official titles are "Youth Spokesman" and "Youth Ambassador," respectively.
zh_cn: 他的官方头衔分别是“青年代言人”和“青年大使”。

source: You see, Gregory Smith is only 15 years old.
zh_cn: 你要知道，格雷戈里史密斯年仅15岁。

source: Yes, that's right -- 15 years old.
zh_cn: 是的，你没听错，他只有15岁。

source: Gregory Smith has accomplished more than most people twice his age - even many three times his age.
zh_cn: 格雷戈里史密斯完成了比他年级大两倍甚至三倍的大多数人的成就。

source: Now you're probably doing the math, "If he's 15 now and already in graduate school, then he had to be like 11 or something when he started college."
zh_cn: 现在，你可能在进行着这样的计算，“如果他现在是15岁并且已经从研究生院毕业，那么他大概11岁左右的时候就开始了大学生活”。

source: Actually, he was ten.
zh_cn: 事实上，他10岁开始上大学。

source: Here are just a few of the stats of Greg's personal timeline:
zh_cn: 这里是一些格雷戈里的个人时间统计：

source: Born June 9, 1989.
zh_cn: 出生于 1989年6月9日

source: Age five: Enrolled in public school.
zh_cn: 5岁 就读于私立公学校

source: Age ten: Graduated from Orange Park High School in Orange Park, Florida (Yes, he squeezed an entire K-12 education in less than half the normally required time.) Joined the freshman class of Randolph-Macon College in Virginia in September
zh_cn: 10岁 毕业于福洛里达州的澄园高中（是的，他花了不到半年的时间学完了其他人整个12年的教育）在九月加入了弗吉尼亚州的伦道夫麦肯学院，就读一年级。

source: Age 11: Named Youth Spokesperson for World Centers of Compassion for Children
zh_cn: 11岁 成为同情儿童世界中心的代言人

source: Age 12: Nominated for 2002 Nobel Peace Prize, made Youth Ambassador for Christian Children's Fund
zh_cn: 12岁 获得2002年诺贝尔和平奖，成为基督教儿童基金会青年大使

source: Age 13: Nominated for 2003 Nobel Peace Prize, graduated Cum Laude with a BS in mathematics and minors in both history and biology with honors from Randolph-Macon College, presented with the "Force For Good Lifetime Achievement Award"
zh_cn: 13岁 被2003年诺贝尔和平奖提名，以数学学士和未成年人在历史和生物学与伦道夫梅肯学院荣誉的优等成绩毕业，拥有“善的力量终身成就奖”

source: Age 14: Awarded a Jack Kent Cooke Scholarship for Graduate Studies, totaling up to $50,000 each year, began graduate study in math at University of Virginia, nominated for the 2004 Nobel Peace Prize, named International Humanitarian of the Year by the Lion's Club, presented with the National Caring Award
zh_cn: 14岁 被授予杰克肯特库克奖学金的研究生，总计高达每年50000美元的奖学金，开始在弗吉尼亚大学研究生学习数学，获2004年诺贝尔和平奖的提名，由狮子会评为年度国际人道主义，出席了国家关怀大奖

source: All this and he's pretty modest, too.
zh_cn: 尽管拥有这一切，但是史密斯相当谦虚。

source: This is what Greg has to say about himself:
zh_cn: 这是格雷戈他对自己的描述

source: Photo courtesy Smith family
zh_cn: 照片是史密斯家族

source: I have been given a special gift which gives me the incredible capability to learn and retain what I have learned.
zh_cn: 我得到了一份特殊的礼物给了我这不可思议的能力的学习和保留我所学到的东西。

source: It is important to remember that I do not know everything; in fact, I know very little in the big picture of wisdom and knowledge.
zh_cn: 我并不知道所有的事这件事很重要要记住。事实上，我对智慧及知识的知道的非常少。

source: I am working very hard and thoroughly enjoying my quest for knowledge!
zh_cn: 我正努力的学习并享受我对知识的追求！

source: My pursuit of knowledge is not a contest to see who is smarter or who has the highest grades.
zh_cn: 我追求的知识不是竞赛，看谁更聪明或者看谁的分数更高。

source: It is a search for answers to questions that perplex society and lead us down a violent path ending in a peaceless life.
zh_cn: 这是一个困扰的社会，带领我们走上暴力的道路生活在不安宁的生活中寻找答案。

source: I want to reverse this cycle.
zh_cn: 我想扭转这个局面。

source: You might expect him to be stuffy.
zh_cn: 你可能觉得他古板无趣。

source: Reporters, interviewers (like David Letterman and Oprah Winfrey) and others don't think so.
zh_cn: 记者，采访者（如戴维和奥普拉温弗丽）和其他人并不这么认为。

source: Other people worry about a childhood lost in the classroom.
zh_cn: 其他人担心他在学习中失去了童年。

source: His parents disagree.
zh_cn: 他的父母不同意这种看法。

source: And, more importantly, so does Greg.
zh_cn: 并且，更重要的是，格雷戈也不这样认为。

source: When asked what he likes to do for fun, Greg has responded, "Learning is fun. Reading is fun."
zh_cn: 当被问到他做什么来消遣，格雷戈回答说：“学习让我快乐，阅读让快乐”。

source: Hey, in many ways, he's also a regular kid.
zh_cn: 嘿，他在很多方面依旧是一个寻常小孩。

source: He finished that question, adding, "I enjoy playing games with friends -- playing football, tennis, basketball, soccer and computer games."
zh_cn: 他回答完那句话后，继续说道：“我喜欢和朋友一起玩——踢足球，打乒乓，篮球，英式足球和电脑游戏。”
